<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>PayloadContent</key>
    <array>
        <dict>
            <key>IKEv2</key>
            <dict>
              <key>OnDemandEnabled</key>
                <integer>${var.ondemand.wifi || var.ondemand.cellular ? 1 : 0}</integer>
              <key>OnDemandRules</key>
              <array>
              <dict>
                %{ if length(var.ondemand.wifi_exclude) > 0 && var.ondemand.wifi == true }
                <key>Action</key>
                <string>Disconnect</string>
                <key>InterfaceTypeMatch</key>
                <string>WiFi</string>
                <key>SSIDMatch</key>
                <array>
                  %{ for i in var.ondemand.wifi_exclude ~}
                  <string>${i}</string>
                  %{ endfor }
                </array>
                %{ endif }
              </dict>
              %{ if var.ondemand.wifi == true }
              <dict>
                <key>Action</key>
                  <string>Connect</string>
                <key>InterfaceTypeMatch</key>
                  <string>WiFi</string>
                <key>URLStringProbe</key>
                  <string>http://captive.apple.com/hotspot-detect.html</string>
              </dict>
              %{ endif }
              %{ if var.ondemand.cellular == true }
              <dict>
                <key>Action</key>
                  <string>Connect</string>
                <key>InterfaceTypeMatch</key>
                  <string>Cellular</string>
                <key>URLStringProbe</key>
                  <string>http://captive.apple.com/hotspot-detect.html</string>
              </dict>
              %{ endif }
              </array>
              <key>AuthenticationMethod</key>
              <string>Certificate</string>
              <key>ChildSecurityAssociationParameters</key>
              <dict>
                  <key>DiffieHellmanGroup</key>
                  <integer>20</integer>
                  <key>EncryptionAlgorithm</key>
                  <string>AES-256-GCM</string>
                  <key>IntegrityAlgorithm</key>
                  <string>SHA2-512</string>
                  <key>LifeTimeInMinutes</key>
                  <integer>1440</integer>
              </dict>
              <key>DeadPeerDetectionRate</key>
              <string>Medium</string>
              <key>DisableMOBIKE</key>
              <integer>0</integer>
              <key>DisableRedirect</key>
              <integer>1</integer>
              <key>EnableCertificateRevocationCheck</key>
              <integer>0</integer>
              <key>EnablePFS</key>
              <true/>
              <key>IKESecurityAssociationParameters</key>
              <dict>
                  <key>DiffieHellmanGroup</key>
                  <integer>20</integer>
                  <key>EncryptionAlgorithm</key>
                  <string>AES-256-GCM</string>
                  <key>IntegrityAlgorithm</key>
                  <string>SHA2-512</string>
                  <key>LifeTimeInMinutes</key>
                  <integer>1440</integer>
              </dict>
              <key>LocalIdentifier</key>
              <string>${var.vpn_users[index]}</string>
              <key>PayloadCertificateUUID</key>
              <string>${var.PayloadIdentifier_pkcs12}</string>
              <key>CertificateType</key>
              <string>ECDSA384</string>
              <key>ServerCertificateIssuerCommonName</key>
              <string>${var.server_address}</string>
              <key>RemoteAddress</key>
              <string>${var.server_address}</string>
              <key>RemoteIdentifier</key>
              <string>algo.istratov.ml</string>
              <key>UseConfigurationAttributeInternalIPSubnet</key>
              <integer>0</integer>
            </dict>
            <key>IPv4</key>
            <dict>
                <key>OverridePrimary</key>
                <integer>1</integer>
            </dict>
            <key>PayloadDescription</key>
            <string>Configures VPN settings</string>
            <key>PayloadDisplayName</key>
            <string>VPN</string>
            <key>PayloadIdentifier</key>
            <string>com.apple.vpn.managed.${var.PayloadIdentifier_vpn}</string>
            <key>PayloadType</key>
            <string>com.apple.vpn.managed</string>
            <key>PayloadUUID</key>
            <string>${var.PayloadIdentifier_vpn}</string>
            <key>PayloadVersion</key>
            <real>1</real>
            <key>Proxies</key>
            <dict>
                <key>HTTPEnable</key>
                <integer>0</integer>
                <key>HTTPSEnable</key>
                <integer>0</integer>
            </dict>
            <key>UserDefinedName</key>
            <string>Algo VPN ${var.server_address} IKEv2</string>
            <key>VPNType</key>
            <string>IKEv2</string>
        </dict>
        <dict>
            <key>Password</key>
            <string>${var.Password_pkcs12}</string>
            <key>PayloadCertificateFileName</key>
            <string>${var.vpn_users[index]}.p12</string>
            <key>PayloadContent</key>
            <data>
            ${pki.ipsec.pkcs12[index]}
            </data>
            <key>PayloadDescription</key>
            <string>Adds a PKCS#12-formatted certificate</string>
            <key>PayloadDisplayName</key>
            <string>${var.vpn_users[index]}.p12</string>
            <key>PayloadIdentifier</key>
            <string>com.apple.security.pkcs12.${var.PayloadIdentifier_pkcs12}</string>
            <key>PayloadType</key>
            <string>com.apple.security.pkcs12</string>
            <key>PayloadUUID</key>
            <string>${var.PayloadIdentifier_pkcs12}</string>
            <key>PayloadVersion</key>
            <integer>1</integer>
        </dict>
        <dict>
            <key>PayloadCertificateFileName</key>
            <string>ca.crt</string>
            <key>PayloadContent</key>
            <data>
            ${var.PayloadContentCA}
            </data>
            <key>PayloadDescription</key>
            <string>Adds a CA root certificate</string>
            <key>PayloadDisplayName</key>
            <string>${var.server_address}</string>
            <key>PayloadIdentifier</key>
            <string>com.apple.security.root.${var.PayloadIdentifier_ca}</string>
            <key>PayloadType</key>
            <string>com.apple.security.root</string>
            <key>PayloadUUID</key>
            <string>${var.PayloadIdentifier_ca}</string>
            <key>PayloadVersion</key>
            <integer>1</integer>
        </dict>
    </array>
    <key>PayloadDisplayName</key>
    <string>${var.server_address} IKEv2</string>
    <key>PayloadIdentifier</key>
    <string>donut.local.${var.PayloadIdentifier_conf}</string>
    <key>PayloadRemovalDisallowed</key>
    <false/>
    <key>PayloadType</key>
    <string>Configuration</string>
    <key>PayloadUUID</key>
    <string>${var.PayloadIdentifier_conf}</string>
    <key>PayloadVersion</key>
    <integer>1</integer>
</dict>
</plist>
